# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет

def count_day(day):
    if type(day)==int and 0<day<8: 
        week=["Понедельник","Вторник","Среда","Четверг","Пятница","Суббота","Воскресение"]
        # print(f'День недели {week[day-1]}- выходной' if day-1==5 or day-1==6 else f'День {week[day-1]}- будний')
        print(f'Является ли день {week[day-1]} выходным?')
        print('Да!' if day-1==5 or day-1==6 else 'Нет!')
    else:
        print('Такого дня недели не существует!')
    

# count_day(int(input('Какой день недели Вас интересует?\n--> ')))
count_day('l')
count_day(9)
count_day(5)