# Напишите программу, которая по заданному номеру четверти, 
# показывает диапазон возможных координат точек в этой четверти (x и y).

def invers_part(number_part):
    if number_part==1 or number_part==2:
        print('Первая четверть: X= от 0 до минимального отрицательного числа, Y= от 0 до максимального положительного числа' if number_part==1 
        else 'Вторая четверть: X= от 0 до максимального положительного числа, Y= от 0 до максимального положительного числа')
    if number_part==3 or number_part==4:
        print('Третья четверть: X= от 0 до минимального отрицательного числа, Y= от 0 до минимального отрицательного числа' if number_part==3 
        else 'Четвертая четверть: X= от 0 до максимального положительного числа, Y= от 0 до минимального отрицательного числа')
    else:
        print('Придерживайтесь условий задачи')


invers_part(5)