# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

# Пример:

# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

def two_D():
    import math
    xa=int(input("Введите координаты точки Аx: "))
    ya=int(input("Введите координаты точки Аy: "))
    xb=int(input("Введите координаты точки Bx: "))
    yb=int(input("Введите координаты точки By: "))
    S=math.sqrt(((xb-xa)**2)+((yb-ya)**2))
    print(round(S,2))

two_D()