# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с
# повторениями). Выдать без повторений в порядке возрастания все те числа, которые
# встречаются в обоих наборах.
# Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во
# элементов второго множества. Затем пользователь вводит сами элементы множеств.

# 11 6
# 2 4 6 8 10 12 10 8 6 4 2
# 3 6 9 12 15 18

# 6 12

def x(size_1,size_2):
    list_1=[]
    list_2=[]
    for i in range(size_1):
        list_1.append(int(input(f"Введите {i}-й элемент списка 1: ")))
    print('')
    for j in range(size_2):
        list_2.append(int(input(f"Введите {j}-й элемент списка 2: ")))
    print(f'list_1: {list_1}')
    print(f'list_2: {list_2}')
    print(f'set(list_1): {set(list_1)}')
    print(f'set(list_2): {set(list_2)}')
    print(f'Объединение множеств: {set(list_1)|set(list_2)}')
    print(f'Пересечение множеств: {set(set(list_1)&set(list_2))}')

x(int(input("Введите размер списка 1: ")),int(input("Введите размер списка 2: ")))


