# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
# круглой грядке, причем кусты высажены только по окружности. Таким образом, у
# каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
# выросло различное число ягод – на i-ом кусте выросло ai
#  ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым
# кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом
# заданной во входном файле грядки.

# 4 -> 1 2 3 4
# 9
import random
def shrubs(num):
    shrubs_list=[]
    for i in range(num):
        shrubs_list.append({i:random.randint(0,10)})
    print(shrubs_list)
    return shrubs_list
 
def berry_counter(list):
    result=0
    max_count_berry=0
    for i in range(len(list)):
        h=i+1
        for j in range(i-1,len(list)):
            if i<=0:j=len(list)-1
            if i==len(list)-1:h=0
            result=list[i].get(i)+list[j].get(j)+list[h].get(h)
            print(f'list[{i}].get({i}): {list[i].get(i)} + list[{j}].get({j}): {list[j].get(j)} + list[{h}].get({h}): {list[h].get(h)} = result: {result}')
            if result>max_count_berry:
                max_count_berry=result
                sh_1,sh_2,sh_3=j,i,h
            break
    print(f'Больше всего ягод было собрано с кустов № {sh_1}, {sh_2}, {sh_3}. \nОбщее количество: {max_count_berry}')
            
berry_counter(shrubs(int(input("Сколько кустов на грядке?: "))))