# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
# они сделали S журавликов. Сколько журавликов сделал каждый
# ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов,
# чем Петя и Сережа вместе?

# 6 -> 1 4 1
# 24 -> 4 16 4
# 60 -> 10 40 10

def children(num):
    num_m=num//6
    print(f'Дети сделали всего {num} журавликов.\nИз них по {num_m} сделал каждый мальчик и {num_m*4} сделала девочка Катя.')

children(6)