# Задача 28: Напишите рекурсивную функцию sum(a, b),
# возвращающую сумму двух целых неотрицательных чисел. Из
# всех арифметических операций допускаются только +1 и -1.
# Также нельзя использовать циклы.
# 2 2
# 4


def sum_1(a,b):
    a+=1
    if b==1: return a
    return sum_1(a,b-1)
    

print(sum_1(5,7))