# Задача 34: Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку
# разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам
# стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число
# гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного
# слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг
# от друга пробелами. Стихотворение Винни-Пух вбивает в программу с клавиатуры. В ответе
# напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не
# в порядке
# Ввод:                                           Вывод:
# пара-ра-рам рам-пам-папам па-ра-па-дам          Парам пам-пам

def minstrel(line_of_verse:str):
    line_of_verse=line_of_verse.split()
    vowels=['а','е','ё','и','о','у','ю','э','я','ы']
    st=[]
    for i in line_of_verse: res=st.append(list(map(lambda x: x in vowels,i)).count(True))
    print('Парам пам-пам' if len(set(st))==1 else 'Пам парам')
minstrel('пара-ра-рам рам-пам-папам па-ра-па-дам')
minstrel('пара-ра-рам рам-пампам-папам па-ра-па-дам')
