# Задайте список из вещественных чисел. Напишите программу, 
# которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

def o(list):
    ar_f=[]
    for i in list:
        val=i%1
        ar_f.append(round(val,3))
    print(ar_f)
    print(f"Разница между max и min= {max(ar_f)-min(ar_f)}")

ar=[0.5, 6.4, 7.05, 5.75, 9.32]
o(ar)