# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя –
# школьница. Петя помогает Кате по математике. Он задумывает два
# натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для
# этого Петя делает две подсказки. Он называет сумму этих чисел S и их
# произведение P. Помогите Кате отгадать задуманные Петей числа.

# 4 4 -> 2 2
# 5 6 -> 2 3
def game():
    import random as r
    x=r.randint(1, 10)
    y=r.randint(1, 10)
    s=x+y
    p=x*y
    print(f'Петя: Здравствуй, сестренка!\nОтгадай числа, которые я загадал для тебя.\nИх сумма равна {s}, а прозведение равно {p}.')
    otvet_x=int(input('Твой ответ?\nПервое число: '))
    otvet_y=int(input('Второе число: '))
    print('Верно!' if (otvet_x==x or otvet_x==y) and (otvet_y==x or otvet_y==y) else 'Получится в следующий раз')

game()