# Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# Пример:
# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

def pomidor(num):
    arr=[0]*num
    pr=1
    for i in range(len(arr)):
        pr*=i+1
        arr[i]=pr
    print(arr)


pomidor(7)